<<<<<<< HEAD
#程序的三个特征
'''
有输入
有处理
有输出
'''
#变量的定义
#变量 = 值， = 赋值符号， == 等号
#类似与数学的中的未知数,它的实际含义是我们赋予它的
a = 10
print(a)
a = 12
print(a)

#在内存中创建一个变量,包含
# 1.变量名称    a
# 2.变量保存的数据  10
# 3.变量存储的数据类型
# 4.变量的地址

#变量名是包含在标识符中的
#尽量做到简单易懂
'''
1.只能是数字，字母，_(下划线)
2.不能以数字开头
3.不能是关键字
4.区分大小写

'''

#关键字
import keyword
print(keyword.kwlist)

#命名规则
'''
1.大驼峰:每个单词的首字母大写 ,MyName
2.小驼峰:第二个(含以后)的单词字母大写, myName
3.下划线: my_name
'''

=======
#程序的三个特征
'''
有输入
有处理
有输出
'''
#变量的定义
#变量 = 值， = 赋值符号， == 等号
#类似与数学的中的未知数,它的实际含义是我们赋予它的
a = 10
print(a)
a = 12
print(a)

#在内存中创建一个变量,包含
# 1.变量名称    a
# 2.变量保存的数据  10
# 3.变量存储的数据类型
# 4.变量的地址

#变量名是包含在标识符中的
#尽量做到简单易懂
'''
1.只能是数字，字母，_(下划线)
2.不能以数字开头
3.不能是关键字
4.区分大小写

'''

#关键字
import keyword
print(keyword.kwlist)

#命名规则
'''
1.大驼峰:每个单词的首字母大写 ,MyName
2.小驼峰:第二个(含以后)的单词字母大写, myName
3.下划线: my_name
'''

>>>>>>> 5169a62fdb26c2a597b35a0bc9f27034826ef6de
